Revit 2027 API
UIControlledApplication.CreateRibbonPanel(String, String) Method
 Create a new RibbonPanel on the specified tab.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual RibbonPanel CreateRibbonPanel(
	string tabName,
	string panelName
)
Public Overridable Function CreateRibbonPanel (
	tabName As String,
	panelName As String
) As RibbonPanel
public:
virtual RibbonPanel^ CreateRibbonPanel(
	String^ tabName,
	String^ panelName
)
abstract CreateRibbonPanel :
        tabName : string *
        panelName : string -> RibbonPanel
override CreateRibbonPanel :
        tabName : string *
        panelName : string -> RibbonPanel
Parameters
tabName String
The name of the tab, on which the new panel will be created.
panelName String
The name of the panel to be created.
Return Value
RibbonPanel
Exceptions
Exception | Condition
ArgumentNullException | tabName or panelName is null.
ArgumentException | tabName or panelName is Empty.
InvalidOperationException | Too many panels have been added to this tab (Maximum is 100).
Remarks
 This method will create a custom panel appending to the specified tab. This method is not supported in Macros.
See Also
Reference
UIControlledApplication Class
CreateRibbonPanel Overload
Autodesk.Revit.UI Namespace